## TCT Day 6 - Pandas cont'

* hw3 walkthrough 
* Pivotting
* Profiling
    - install pandas-profiling & import pandas_profiling
* Working with API & JSON

In [10]:
import pandas as pd

In [3]:
#pip install pandas-profiling

In [5]:
#import pandas_profiling

In [4]:
#!pip install markupsafe

In [7]:
#from pandas_profiling import ProfileReport

In [11]:
a_dict = {
    'school': 'ABC primary school',
    'location': 'London',
    'ranking': 2,
    'info': {
        'president': 'John Kasich',
        'contacts': {
          'email': {
              'admission': 'admission@abc.com',
              'general': 'info@abc.com'
          },
          'tel': '123456789',
      }
    },
    'students': [
      { 'name': 'Tom' },
      { 'name': 'James' },
      { 'name': 'Jacqueline' }
    ],
}

In [20]:
pd.json_normalize(a_dict)

,school,location,ranking,students,info.president,info.contacts.email.admission,info.contacts.email.general,info.contacts.tel
0,ABC primary school,London,2,"[{'name': 'Tom'}, {'name': 'James'}, {'name': ...",John Kasich,admission@abc.com,info@abc.com,123456789

In [17]:
pd.json_normalize(a_dict, record_path =['students'])

         name
0         Tom
1       James
2  Jacqueline

In [13]:
URL="https://raw.githubusercontent.com/domoritz/maps/master/data/iris.json"

In [16]:
URL

'https://raw.githubusercontent.com/domoritz/maps/master/data/iris.json'

In [14]:
from_web=pd.read_json(URL)

In [23]:
type(from_web)

pandas.core.frame.DataFrame

In [21]:
json_list = [
    { 
        'class': 'Year 1', 
        'student count': 20, 
        'room': 'Yellow',
        'info': {
            'teachers': { 
                'math': 'Rick Scott', 
                'physics': 'Elon Mask' 
            }
        },
        'students': [
            { 
                'name': 'Tom', 
                'sex': 'M', 
                'grades': { 'math': 66, 'physics': 77 } 
            },
            { 
                'name': 'James', 
                'sex': 'M', 
                'grades': { 'math': 80, 'physics': 78 } 
            },
        ]
    },
    { 
        'class': 'Year 2', 
        'student count': 25, 
        'room': 'Blue',
        'info': {
            'teachers': { 
                'math': 'Alan Turing', 
                'physics': 'Albert Einstein' 
            }
        },
        'students': [
            { 'name': 'Tony', 'sex': 'M' },
            { 'name': 'Jacqueline', 'sex': 'F' },
        ]
    },
]

In [25]:
df = pd.DataFrame([['a', 'b'], ['c', 'd']],
                  index =['row 1', 'row 2'],
                  columns =['col 1', 'col 2'])
  
# Indication of expected JSON string format
print(df.to_json(orient ='split'))
  
print(df.to_json(orient ='index'))

print(df.to_json())

{"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]}
{"row 1":{"col 1":"a","col 2":"b"},"row 2":{"col 1":"c","col 2":"d"}}
{"col 1":{"row 1":"a","row 2":"c"},"col 2":{"row 1":"b","row 2":"d"}}

In [26]:
df

      col 1 col 2
row 1     a     b
row 2     c     d